Repository: wiut00011193/sometesting
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

# learningJourneyPageTitle
source: Learning journey
ru: Обучающее путешествие
uz: O'rganish sayohati

# pageTitleNotifications
source: Notifications
ru: Уведомления
uz: Bildirishnoma

# pageTitleAttendance
source: Attendance
ru: Посещаемость
uz: Davomat

# pageTitleRating
source: Weekly Rating
uz: Haftalik reyting

# text_month
source: month
uz: месяц

source: Hackers
ru: Хакеры
uz: Xakerlar

source: Coders
ru: Кодеры
uz: Koderlar

source: Gamers
ru: Геймеры
uz: Geymerlar

# text_confirmation
source: Confirmation
uz: Tasdiqlash

# text_yes
source: Yes
uz: Ha

# text_no
source: No
uz: Yo'q

# january_full
source: January
uz: Yanvar

# february_full
source: February
uz: Fevral

# march_full
source: March
uz: Mart

# april_full
source: April
uz: Aprel

# june_full
source: June
uz: Iyun

# july_full
source: July
uz: Iyul

# august_full
source: August
uz: Avgust

# september_full
source: September
uz: Sentabr

# october_full
source: October
uz: Oktabr

# november_full
source: November
uz: Noyabr

# december_full
source: December
uz: Dekabr

# monday_full
source: Monday
uz: Dushanba

# tuesday_full
source: Tuesday
uz: Seshanba

# wednesday_full
source: Wednesday
uz: Chorshanba

# thursday_full
source: Thursday
uz: Payshanba

# friday_full
source: Friday
uz: Juma

# saturday_full
source: Saturday
uz: Shanba

# sunday_full
source: Sunday
uz: Yakshanba

# monday_short
source: Mon
uz: Du

# tuesday_short
source: Tue
uz: Se

# wednesday_short
source: Wed
uz: Chor

# thursday_short
source: Thu
uz: Pay

# friday_short
source: Fri
uz: Juma

# saturday_short
source: Sat
uz: Shan

# sunday_short
source: Sun
uz: Yak

source: Attendance
ru: Посещаемость
uz: Davomat

# attendanceSeeAll
source: See all
ru: Посмотреть все
uz: To'liq ko'rish

source: Exam
ru: Экзамен
uz: Imtixon

# examTotalScore
source: Total score:
ru: Общий бал:
uz: Yakuniy baho:

source: Exam results
ru: Результаты экзамена
uz: Imtixon natijalari

source: Booking list
ru: Записанные уроки
uz: Yozilingan darslar

source: Booked
ru: Записано
uz: Yozilingan

source: Tutor booking
ru: Записаться на урок
uz: Qo'shimcha ga yozilish

# chooseTutor
source: Choose your tutor
ru: Выберите тутора
uz: Tutor tanlang

source: Choose date and time
ru: Выберите день и время
uz: Kun va vaqtni tanlang

source: Confirm
ru: Подтвердить
uz: Tasdiqlash

# tutorList
source: List of tutors
ru: Список туторов
uz: Tutorlar ro'yhati

source: Days
ru: Дни
uz: Kunlar

source: Hours
ru: Время
uz: Vaqtlar

# text_make_payment
source: Payment
uz: To'lov qilish

# text_payment_status
source: Payment status
uz: To'lov holati

# text_child_active
source: Active
uz: Faol

# text_child_inactive
source: Inactive
uz: Qarzdorlik

# text_course_payment_reminder
source: Please settle the course fee
uz: Iltimos, kurs to'lovini amalga oshiring

# text_course_payment_paid
source: The course fee is settled
uz: Kurs to’lovi amalga oshirilgan

# text_attendance
source: Attendance
uz: Davomat

# text_lesson_count
source: Lesson count
uz: Darslar soni

# text_attendance_see_all
source: See all
uz: To'liq ko'rish

# text_attendance_table
source: timetable
uz: dars jadvali

# text_story_type_events
source: Events
uz: Eventlar

# text_story_type_news
source: News
uz: Yangiliklar

# text_story_type_rules
source: Rules
uz: Qoidalar

# text_story_type_students
source: Students
uz: O'quvchilar

# text_story_uploaded
source: Uploaded
uz: Joylandi

# text_extra_lesson_hero
source: Extra Lesson
uz: Yordamchi ustoz

# text_extra_lesson_book
source: Book Timeslot
uz: Band qilish

# text_choose_account
source: Choose Account
uz: Hisob Tanlash

# text_add_child
source: Add a child
uz: Farzandimni qo'shaman

# text_confirmation_delete_child
source: Do you want to delete the child?
uz: Farzandni o'chirasizmi?

# text_child_deleted
source: The child has been deleted
uz: Farzand o'chirildi

# text_no_extra_lesson_booked
source: No Extra Lesson Booked. Press on "+" icon if you want to book an extra lesson.
uz: Qo'shimcha dars mavjud emas, darsga yozilish uchun "+" tugmasini bosing.

# text_last_booked_teacher
source: Last Booked
uz: So'ngi tanlangan

# text_exam_results
source: Exam results
uz: Imtixon natijasi

# text_exam_total_score
source: Total score
uz: Yakuniy baho

# text_file
source: File
uz: Fayl

# text_no_file
source: No File
uz: Fayl yo'q

# text_link
source: Link
uz: Havola

# text_no_link
source: No Link
uz: Havola yo'q

# text_feedback
source: Feedback
uz: Instruktor Izohi

# text_no_feedback
source: No Feedback
uz: Feedback yo'q

# text_about
source: About
uz: Vazifa haqida

# text_requirements
source: Requirements
uz: Vazifa uchun talablar

# text_theory
source: Theory
uz: Nazariya

# text_assignment_not_uploaded
source: Not uploaded
uz: Topshirilmagan

# text_assignment_pending
source: Pending
uz: Tekshirilmoqda

# text_assignment_checked
source: Checked
uz: Baholandi

# text_assignment_denied
source: Denied
uz: Qabul qilinmadi

# text_press_to_add_child
source: Press the button to add a child
uz: O'quvchini qo'shish uchun tugmani bosing

# text_enter_student_id
source: Enter student ID
uz: Student IDni kiriting

# text_enter_password
source: Enter Password
uz: Password kiriting

# text_added_children
source: Children added
uz: Qo'shilgan o'quvchilar

# text_add
source: Add
uz: Qo'shish

# text_continue
source: Continue
uz: Keyingisi

# error_try_later
source: Please Try Later
uz: Keyinroq urunib ko'ring

# error_wrong_password
source: Wrong password, please try again
uz: Parol noto'g'ri kiritildi, iltimos takror kiriting

# error_child_already_added
source: Child already added
uz: Bola hisobga qo'shilib bo'lgan

# error_empty_field
source: Fill in empty field(s)
uz: Keraklik ma'lumot kiritilmagan
